import entities.Drink

fun main() {
    val drink = Drink
        .Builder()
        .type("Tea")
        .temperature("Cold")
        .diningOption("In place")
        .build()

    println(drink)
}


//|Функция| Преобразовать | Конфигурировать | Возвращает          |
//|       |  объект?      |объект или фун?  |                     |
//|-------|---------------|-----------------|---------------------|
//| let   |     ✅        |       ❌        | Результат выражения |
//| apply |     ❌        |       ✅        | Сам объект          |
//| also  |     ❌        |       ❌        | Сам объект          |
//| run   |     ✅        |       ✅        | Результат выражения |
//| with  |     ✅        |       ✅        | Результат выражения |

